In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [2]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [3]:
%%sql

SELECT *
FROM facts
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [4]:
%%sql

SELECT MIN(population) AS Min_Population,
       MAX(population) AS Max_Population, 
       MIN(population_growth) AS Min_population_growth,
       MAX(population_growth) AS Max_population_growth
FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [5]:
%%sql

SELECT name
FROM facts
WHERE population == (
    SELECT MIN(population)
    FROM facts
);

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

In [6]:
%%sql

SELECT name
FROM facts
WHERE population == (
    SELECT MAX(population)
    FROM facts
);

 * sqlite:///factbook.db
Done.

[('World',)]

In [7]:
%%sql

SELECT MIN(population) AS Min_Population,
       MAX(population) AS Max_Population, 
       MIN(population_growth) AS Min_population_growth,
       MAX(population_growth) AS Max_population_growth
FROM facts
WHERE name != 'World';

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [12]:
%%sql

SELECT CAST(ROUND(AVG(population), 0) as integer) as AVG_Population,
       CAST(ROUND(AVG(area), 0) as integer) as AVG_Area
FROM facts;

 * sqlite:///factbook.db
Done.

[(62094928, 555094)]

In [15]:
%%sql

SELECT name
FROM facts
WHERE population > (SELECT CAST(ROUND(AVG(population), 0) as integer) FROM facts) and 
                    area < (SELECT CAST(ROUND(AVG(area), 0) as integer) FROM facts);

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

# Which country has the most people? Which country has the highest growth rate?

In [25]:
%%sql

SELECT name, MAX(population)
FROM facts
WHERE name != 'World';

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

In [28]:
%%sql

SELECT name, MAX(population_growth)
FROM facts
WHERE name != 'World';

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02)]

## Which countries have the highest ratios of water to land?

In [34]:
%%sql

SELECT name, (area_water / area_land) as Ratio_water_land
FROM facts
WHERE Ratio_water_land > 0
ORDER BY Ratio_water_land DESC;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905), ('Virgin Islands', 4)]

## Which countries have more water than land?

In [36]:
%%sql

SELECT name, (area_water > area_land) as More_land
FROM facts
WHERE More_land == 1;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 1), ('Virgin Islands', 1)]

## Which countries will add the most people to their populations next year?

In [40]:
%%sql

SELECT name, CAST(population * (population_growth/100) AS integer) as population_increase
FROM facts
WHERE name != 'World'
ORDER BY population_increase DESC
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('India', 15270686),
 ('China', 6153684),
 ('Nigeria', 4448270),
 ('Pakistan', 2906653),
 ('Ethiopia', 2874562)]

## Which countries have a higher death rate than birth rate?

In [47]:
%%sql

SELECT name, (death_rate > birth_rate) AS Mortality_inversed
FROM facts
WHERE Mortality_inversed == 1 and name != 'World';

 * sqlite:///factbook.db
Done.

[('Austria', 1),
 ('Belarus', 1),
 ('Bosnia and Herzegovina', 1),
 ('Bulgaria', 1),
 ('Croatia', 1),
 ('Czech Republic', 1),
 ('Estonia', 1),
 ('Germany', 1),
 ('Greece', 1),
 ('Hungary', 1),
 ('Italy', 1),
 ('Japan', 1),
 ('Latvia', 1),
 ('Lithuania', 1),
 ('Moldova', 1),
 ('Monaco', 1),
 ('Poland', 1),
 ('Portugal', 1),
 ('Romania', 1),
 ('Russia', 1),
 ('Serbia', 1),
 ('Slovenia', 1),
 ('Ukraine', 1),
 ('Saint Pierre and Miquelon', 1)]

## Which countries have the highest population/area ratio

In [48]:
%%sql

SELECT name, (population/area) AS pop_area_ratio
FROM facts
WHERE name != 'World'
ORDER BY pop_area_ratio DESC
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Macau', 21168),
 ('Monaco', 15267),
 ('Singapore', 8141),
 ('Hong Kong', 6445),
 ('Gaza Strip', 5191),
 ('Gibraltar', 4876),
 ('Bahrain', 1771),
 ('Maldives', 1319),
 ('Malta', 1310),
 ('Bermuda', 1299)]

In [30]:
%%sql

select * from facts limit 1;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51)]